---   
 <img align="left" width="75" height="75"  src="https://upload.wikimedia.org/wikipedia/en/c/c8/University_of_the_Punjab_logo.png"> 

<h1 align="center">Department of Data Science</h1>
<h1 align="center">Course: Tools and Techniques for Data Science</h1>

---
<h3><div align="right">Instructor: Muhammad Arif Butt, Ph.D.</div></h3>

<h1 align="center">Lecture 3.14 (Pandas-06)</h1>

<img align="right" width="400" height="400"  src="images/pandas-apps.png"  >

## _Modifying and Sorting Dataframes.ipynb_

In [ ]:
# To install this library in Jupyter notebook
#import sys
#!{sys.executable} -m pip install pandas

In [ ]:
import pandas as pd
pd.__version__ , pd.__path__

## Learning agenda of this notebook
1. Modifying Column indices/labels/names of Dataframe
2. Modifying Row indices of Dataframe
3. Modifying Row(s) Data (Records) of a Dataframe
    - Modifying a single Row
    - Modifying multiple Rows
        - The `df.apply()` Method
        - The `df.map()` Method
        - The `df.mapapply()` Method
        - The `df.replace()` Method
        
4. Adding Column(s) in a Dataframe (unconditionally and conditionally)
5. Removing Column(s) from a Dataframe (unconditionally and conditionally)
6. Adding Row(s) in a Dataframe (unconditionally and conditionally)
7. Removing Row(s) from a Dataframe (unconditionally and conditionally)
8. Bonus: (Sorting)

##  Read a Sample Dataframe

In [1]:
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [2]:
# `shape` attribute of a dataframe object return a two value tuple containing rows and columns
# Note the rows count does not include the column labels and column count does not include the row index
df.shape

(16, 10)

In [3]:
# `index` attribute of a dataframe object return the list of row indices and its datatype
df.index

RangeIndex(start=0, stop=16, step=1)

In [4]:
# `columns` attribute of a dataframe object return the list of column labels and its datatype
df.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [5]:
# `dtypes` attribute of a dataframe object return the data type of each column in the dataframe
df.dtypes

roll no         object
name            object
age              int64
address         object
session         object
group           object
gender          object
subj1          float64
subj2          float64
scholarship    float64
dtype: object

## 1. Modifying Column Names of a Dataframe
- Every dataframe has column labels associated with its columns
- These by default are integer values from 0,1,2,3...
- However, while creating a dataframe from scratch, or while reading them from a file you can set them to more meaningful string values.
- While reading from csv file the first row in the file is taken as the column labels
- We can change the column labels, if we want
- Let us practically see this for better understanding

In [9]:
! cat datasets/groupdatawithoutcollables.csv

MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800

### a. While Reading a Dataset in a Dataframe
- Pass a List of column names to `names` argument of `pd.read_csv()` method

In [45]:
df = pd.read_csv('datasets/groupdatawithoutcollables.csv', names = ['roll no', 'name', 'age', 'address', 'session', 
                                                                'group', 'gender','subj1', 'subj2', 'scholarship'])

df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

### b. After Dataframe is Loaded (Use `columns` attribute of dataframe)

In [46]:
df = pd.read_csv('datasets/groupdatawithoutcollables.csv', header = None)
df.head(3)

,0,1,2,3,4,5,6,7,8,9
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [47]:
df.columns = ['roll no', 'name', 'age', 'address', 'session', 'group', 'gender', 'subj1', 'subj2', 'scholarship']
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

>- Suppose we have a dataframe in which there are certain column labels having spaces in between the names.
>- We want to rename all such columns by replacing the space character with an underscore
>- One way to do this is call `replace()` method of String class on all the column names of dataframe

In [48]:
df.columns.str.replace(' ', '_')

Index(['roll_no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [49]:
df.columns = df.columns.str.replace(' ', '_')

In [50]:
df.columns

Index(['roll_no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

>- Suppose we have a dataframe in which there are column labels having names in different cases.
>- We want to rename all such columns such that the names are all lower or all upper case.
>- One way to do this is to generate a new list as per the requirement using List comprehension.

In [51]:
list1 = [x.upper() for x in df.columns]
list1

['ROLL_NO',
 'NAME',
 'AGE',
 'ADDRESS',
 'SESSION',
 'GROUP',
 'GENDER',
 'SUBJ1',
 'SUBJ2',
 'SCHOLARSHIP']

In [52]:
df.columns = list1
df.head(3)

,ROLL_NO,NAME,AGE,ADDRESS,SESSION,GROUP,GENDER,SUBJ1,SUBJ2,SCHOLARSHIP
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

### c. After Dataframe is Loaded (Use `df.rename()` method)
- What if your dataframe has lots and lots of columns having appropriate column names, and you just want to change just one or two column names and not all of them.
- Use `df.rename()` method to modify one or more column names to new one
```
df.rename(mapper, axis=None, inplace=False)
```
- Where,
    - `mapper`: can be a dictionary having comma separated key:value pairs, where, key is the old column name, while the value is the new column name
    - `axis`: If you want to change the column names use axis = 1 (column axis that moves from left to right)
    - `inplace`: If you want this change to occur inplace make this argument True, in which case the method will return None

In [68]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [65]:
#Since the inplace argument is by default False, so the rename() method will return a new dataframe
df.rename(mapper={'roll no': 'rollno'}, axis=1)

,rollno,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [58]:
df.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [69]:
#Since the inplace argument is now set to True, so the rename() method will return None
#however, the `df` will be changed
df.rename(mapper={'roll no': 'rollno'}, axis=1, inplace=True)

In [70]:
df.columns

Index(['rollno', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

## 2. Modifying Row Indices of a Dataframe
- Every dataframe has row index associated with every row, normally are integer values from 0,1,2,3...
- After you have sliced a datafreame on a condition or sorted a dataframe, these row indices will be randomized.
- We have seen in detail in our previous session the two methods namely `df.set_index()` and `df.reset_index()`, to handle this issue.

## 3. Modifying Row(s) Data (Records) of a Dataframe

### a. Modify Data of a Single Row

In [117]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

>Let us suppose we want to change the `subj1` and `subj2` marks of Shaista

In [118]:
df.loc[2,:]

roll no             MS03
name             Shaista
age                   35
address          Karachi
session        AFTERNOON
group            group B
gender            Female
subj1               64.9
subj2               75.1
scholarship       8500.0
Name: 2, dtype: object

In [119]:
df.loc[df.name=='Shaista', :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

**Option 1:** One way is to pass a new list of values for all the columns and assign it to the appropriate series

In [120]:
# Any of the following two LOC will work
df.loc[df.name=='Shaista', :] = ['MS03', 'Shaista', 35, 'Karachi', 'AFTERNOON', 'group B', 'Female', 9, 99, 8500.0]
df.loc[2,:] = ['MS03', 'Shaista', 35, 'Karachi', 'AFTERNOON', 'group B', 'Female', 9, 99, 8500.0]
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,9.0,99.0,8500.0

**Option 2:** A better way is to assign only those two values that we want to change instead of assigning the complete list of values in that row

In [121]:
df.loc[2, ['subj1', 'subj2']]

subj1     9.0
subj2    99.0
Name: 2, dtype: object

In [122]:
df.loc[df.name=='Shaista', ['subj1', 'subj2']]

   subj1  subj2
2    9.0   99.0

In [123]:
df.loc[df.name=='Shaista', ['subj1', 'subj2']] = [100, 100]
df.loc[2, ['subj1', 'subj2']] = [100, 100]
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,100.0,100.0,8500.0

In [124]:
# If you don't remember the row index, you may use the name
df.loc[df.name=='Shaista',['subj1', 'subj2']]

   subj1  subj2
2  100.0  100.0

In [125]:
df.loc[df.name=='Shaista',['subj1', 'subj2']] = [100, 100]
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,100.0,100.0,8500.0

**Note: You can also use `df.iloc[]` method instead of `df.loc[]` to change multiple or single value of a row. Other than these two you may also try using `df.at[]` method to change a single value of a row.**
```
df.loc[filter, 'column(s)'] = 'value(s)'
```

### b. Modify Data of Multiple Rows
- To Modify data of multiple rows at the same time, you can use any of the four methods:
    - `df.apply()`
    - `df.map()`
    - `df.applymap()`
    - `df.replace()`

### i. The `df.apply()` Method

### ii. The `df.map()` Method

### iii. The `df.applymap()` Method

### iv. The `df.replace()` Method

## 1. How to Add/Delete a Column in a Dataframe (unconditionally)

### a. Add a New Column to a Dataframe
- To add a new column in a dataframe, create an appropriate series and then assign it to the dataframe
- Every time a new series is added to a dataframe, its name automatically becomes an attribute of that dataframe.
- It can be a series created from scratch, which can be cumbersome if the dataframe has thousands of rows.
- Another common way to add a column is construct a series from the existing data within the dataframe
- Let us understand this with an example

In [ ]:
df.columns

In [ ]:
df.subj1 + df.subj2

In [ ]:
df.subj1.add(df.subj2)

In [ ]:
ser1 = df.subj1.add(df.subj2, fill_value=0)
ser1

In [ ]:
# On the left side of assignment you must use `[]` operator, while on the right you can use dot operator as well
df['total'] = ser1

Note that once, nothing appears to happen after you execute a Jupyter notebook cell, that means some processing has been done in the background. Over here, a new column has been added to the dataframe named df. Let us confirm this

In [ ]:
df.head()

**Dear students, how can we add a column in the beginning or in between instead of adding it at the end?**

### b. Delete a Column from a Dataframe
- You can use any of the following ways to delete a column from a dataframe:
    - Use `del df['colname']`, which will remove the column, but will not return it
    - Use `df.pop('colname')` method which will remove that column as well as return the deleted column as a series
    - Use `df.drop()` is a better method than the above two. It can delete more than one columns and is not inplace, i.e., you can use it just to check out and once you are sure you can make it inplace

**Option 1: `del df['colname']`**

In [ ]:
df.columns

In [ ]:
del df['total']

In [ ]:
df.head()

**Option 2: `df.pop('colname')`**

In [ ]:
df.pop('address')

In [ ]:
df.head()

**Option 3:**
```
df.drop(columns=[---],  axis=1, inplace=False)
```
- If you want to drop column(s), pass the names of columns to be deleted as a Python List to the `columns` parameter
- Axis argument specifies the direction of operation
    - `axis=1` or `axis='columns'` means column wise, in vertical direction, used to delete a column from dataframe
- Most of Pandas methods that return a dataframe has an inplace paremeter with default value set to False. It means the operation will not effect the underlying change

In [ ]:
import pandas as pd
df = pd.read_csv('../course-datasets/groupdata.csv')
df.head()

In [ ]:
# Remember axis is the direction of operation, 
df.drop(columns=['age', 'address'], axis=1)

In [ ]:
df.head()

In [ ]:
df.drop([])

## 2. How to Add/Delete a Row in a dataframe (unconditionally)

In [ ]:
import numpy as np
import pandas as pd
df = pd.read_csv('../course-datasets/groupdata.csv')
df.tail()

### b. Add a Row in the Dataframe
- To add a new row in a dataframe, create an appropriate dataframe and then use `df.append()` method, which will return a new dataframe with the row added.
```
df.append(other, ignore_index=False)
```
**More on append in next session**

In [ ]:
newdf = pd.DataFrame(data=[['MS222', 'New Student', 100, 'Kamokey', 'AFT', 'group D', 'Male', 55.0, 55.0, 9999]],
     columns=['roll no', 'name', 'age', 'address', 'session', 'group', 'gender','subj1', 'subj2', 'scholarship'])
newdf

If we try to add a row with lesser values than the number of columns in the DataFrame, it results in a ValueError,

In [ ]:
df1 = df.append(newdf, ignore_index=True)
df1

### c. Delete a Row in the Dataframe
- The `dr.drop()` method as used above to delete columns, can be used to delete one or more rows from a dataframe
```
df.drop(index=[---],  axis=0, inplace=False)
```

**`df.drop(listofcolnames, axis=0, inplace=True')`**

- If you want to drop row(s) pass the row indices to be deleted as a Python List to the `index` parameter
- Axis argument specifies the direction of operation
    - `axis=0` or `axis='index'` means row wise, in horizontal direction, used to delete a row from dataframe
- The default value of inplace argument in most of Pandas methods is False, meaning the method will return a new dataframe after performing the operation and the original dataframe remains unchanged
- Most of Pandas methods taht return a datafram has an inplace paremeter with default value set to False. It means the operation will not effect the underlying change

In [ ]:
df.head()

In [ ]:
df.drop(index=[0,1], axis=0).head()

## 3. Adding a New Column with Conditional Values

**Create a Simple Dataframe**

In [ ]:
import numpy as np
import pandas as pd
df = pd.read_csv('../course-datasets/groupdata.csv')
df.head()

df.head()

**Add a new column 'Grade Subj1', containing string "Good" if subj1>80, else "Bad"**

In [ ]:
df['Grade Subj1'] = ['Good' if i >=80 else 'Bad' for i in df.subj1]
df

**Add a new column 'Grade Subj2', containing string "A", "A-" ... based on multiple conditions of Total marks**

In [ ]:
# Create a new column named 'Grade', having overall grades of the three subjects based on their total marks 

# Add a new column named 'Grade'
df['Grade Subj2'] = ['A' if x >= 80 else 'B' if x >= 70 else 'C' if x>= 60 else "Bad Grade" for x in df.subj2]
df

## 4. Delete a Row Based on Specific Condition

In [ ]:
df

In [ ]:
# Let us drop an entire row from the data frame, in which name is 'Maaz'
# Get the indices where name == 'Maaz' using the .index function
count = df[df['name'] == 'Hadeed'].index
count

In [ ]:
# Pass those indices to the drop method to delete those rows
df.drop(count, inplace = True)
df

## 6. Delete a Column  Based on Specific Condition

In [ ]:
# Let us drop a column from the data frame, if it contains more than 2 NaN values
# It will delete the Total column

df.drop(df.columns[df.apply(lambda col: col.isnull().sum() > 2)], axis=1)

## Change Datatype of a Pandas Series

### a. Changing Datatype from object to float

In [ ]:
import numpy as np
import pandas as pd


df = pd.read_csv('../course-datasets/chiporders.csv')
df.head()

In [ ]:
df.dtypes

In [ ]:
#Suppose we want to change the quantity column to float64 dtype
import numpy as np
df['quantity'] = df.quantity.astype(float)
df.dtypes

In [ ]:
#df['item_price'] = df.item_price.astype(float)

In [ ]:
df.item_price.str.replace('$', '')
#df['item_price'] = df.item_price.astype(float)

In [ ]:
df['item_price'] = df.item_price.str.replace('$', '')
df['item_price']

In [ ]:
df['item_price'] = df.item_price.str.replace('$', '').astype(float)
df['item_price']

In [ ]:
df.item_price.mean()

### b. Changing Datatype from string to boolean

In [ ]:
import numpy as np
import pandas as pd
df = pd.read_csv('../course-datasets/groupdata.csv')
df.head()

In [ ]:
df.gender.str.contains('Male')

In [ ]:
df.gender.str.contains('Female')

In [ ]:
df.gender.str.contains('Female').astype(int)

In [ ]:
df['gender'] = df.gender.str.contains('Male').astype(int)

In [ ]:
df

## 4. Deleting, and Adding  a Row in a Dataframe

### a. Deleting Rows from a  Dataframe
- - To delete a row from a dataframe you can use the `df.drop()` method as used to drop a column. You just have to mention the axis argument to  0

**`df.drop(listofcolnames, axis=0, inplace=True')`**

In [ ]:
df.shape

In [ ]:
df.drop([1,2], axis=0, inplace=True)
df.head()

In [ ]:
df.shape

### b. Add a Row in a Dataframe
- To add a new row in a dataframe, create an appropriate dataframe and then use `df.append()` method, which will return a new dataframe with the row added.
```
df.append(other, ignore_index=False)
```
**More on append in future session**

In [ ]:
newdf = pd.DataFrame(data=[['MS555', 'Kakamanna', 'group D', 55.0, 55.0, 9999]],
                     columns=['roll_no', 'name', 'group', 'subj1', 'subj2', 'scholarship'])
newdf

In [ ]:
df1 = df.append(newdf, ignore_index=True)
df1

**Dear students, how can we add a row in the beginning or in between instead of adding it at the end?**

## Learning agenda of this notebook

1. Sorting dataframes using sort_values()
    - Creating a simple Dataframe
    - Understanding sort_values()
    - Sorting by Single Column
    - Sorting by Multiple Columns
    - Reset the Index
    - Handle NaN Values
2. Sorting dataframes using sort_index()
    - Sorting by Column Label
    - Sorting by Index

## 1. Sorting dataframes using `df.sort_values()`

>Pandas data frame has two useful functions. **`df.sort_values()`** to sort by values of one or more columns and **`df.sort_index()`** to sort by the index. Each of these functions come with numerous options, like sorting in specific order (ascending or descending), sorting in place, sorting with missing values, sorting by specific algorithm etc.
- The `df.sort_values()` function sort by the values along either axis. It returns a dataframe with sorted values or None if 'inplace=True'. Its signature is:
```
df.sort_values(by,axis=0,ascending=True,inplace=False,kind='quicksort',na_position='last',ignore_index=False)
```
Where,
-  `by`: str or list of str to sort
-  `axis`: If `axis` is 0 or 'index' then 'by' may contain index levels and/or column labels. If `axis` is 1 or 'columns' then 'by' may contain column levels and/or index labels.
- `ascending`: if True then ascending and if False then descending
- `inplace`:  If True, perform operation in-place.
- `kind`: {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'. This option is only applied when sorting on a single column or label.
- `na_position`: If first then puts NaNs at the beginning. Default is last
- `ignore_index`: If True, the resulting axis will be labeled 0, 1, , n - 1. Default False

### a. Creating a Simple Dataframe

In [ ]:
# Let us create a simple data frame
import pandas as pd
df = pd.DataFrame({
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Kamal', 'Saima', 'Jamal', 'Shaikh', 'Farzana'],
    'gender' : ['M', 'F', 'M', 'M', 'F'],
    'grade'  : ['A', 'A', 'B', 'B', 'A'],
    'marks'  : [ 21,  23,  12,  14,  20],
    'city' : ['Lahore', 'Peshawer', 'Lahore', 'Karachi', 'Peshawer']
})
df

### b. Sorting by Single Column

In [ ]:
# Let us sort the data by grade column
# By default the sorting is done in ascending order and is not inplace
sorted_df = df.sort_values(by=['marks'])
sorted_df

In [ ]:
# Note since the sorting is not inplace, so the original dataframe is still unsorted
df

In [ ]:
# Let us do an in-place sort and in descending order
df.sort_values(by=['marks'], ascending=False, inplace=True)
df

### c. Sorting by Multiple Columns

In [ ]:
# Let us sort again in ascending order by grade
d1 = df.sort_values(by=['grade'])
d1

- Note in above output, we have sorted the data based on the grade column. You can observe that some of the students with higher marks are ranked lower.
- We want to sort the data based on both grades and marks.

In [ ]:
# sort the dataframe
d2 = df.sort_values(by=['grade','marks'])
d2

- Note that the data is first sorted by grade, and then within grade it is sorted by marks
- Let us now sort by grades in ascending order and marks in descending order.

In [ ]:
d3 = df.sort_values(by=['grade','marks'], ascending=[True,False])
d3

- When sorting by multiple columns, `df.sort_value()` uses the first variable first and second variable next. 
- Let us understand this by switching the order of column names in the list.

In [ ]:
# changed the order of columns
# When sorting by multiple columns, pandas sort_value() uses the first variable first and second variable next. 
# Let us understand this by switching the order of column names in the list.
d4 = df.sort_values(by=['marks','grade'])
d4

### d. Reset the Index (if you want)
- After you sort your dataset, you can observe that the index is also shuffled according to the sorting. If we want to reset the index we use `reset_index()` function.

In [ ]:
d4.reset_index()

- Observe that now it has created another column 'index' which is the previous index. 
- If you want to remove this just pass the parameter `drop = True` and also `inplace = True` to save the state.

In [ ]:
d4.reset_index(inplace=True, drop=True)
d4

### e. Handle NaN Values

In [ ]:
import numpy as np
import pandas as pd
a2DNumPyArray =[
           ['MS01', 'Rauf',    52, 'Lahore',    'MORNING',   'group C', 'Male',   78.3, 84.4, 5000],
           ['MS02', 'Arif',    51, 'Islamabad', 'AFT',       'group A', 'Male',   70.5, np.nan, 6000],
           ['MS03', 'Shaista', 35, 'Karachi',   'AFTERNOON', 'group B', 'Female', 64.9, 75.1, 8500],
           ['MS04', 'Hadeed',  20, 'Lahore',    'MOR',       'group A', 'Male',   np.nan, 84.3, 4000],
           ['MS05', 'Zara',    40, 'Peshawer',  'AFT',       'group D', 'Female', 65.9, 72.8, 3500],
           ['MS06', 'Mohid',   16, 'Lahore',    'MORNING' ,  'group C', 'Female', 69.3, 78.6, np.nan],
           ['MS07', 'Zobia',   40, 'Sialkot',   'AFT',       'group B', 'Female', 90.2, np.nan, 4000],
           ['MS08', 'Idrees',  51, 'Multan',    'MORNING',   'group D', 'Male',   84.1, 76.0, 8000],
           ['MS09', 'Jamil',   53, 'Karachi',   'AFT',       'group C', 'Male',   90.5, 81.3, np.nan],
           ['MS10', 'Shahid',  38, 'Lahore',   'AFTERNOON', 'group D', 'Male',   90.5, 81.3, 3800],
           ['MS11', 'Khurram', 35, 'Islamabad',   'MOR',       'group B', 'Male',   90.5, 81.3, 6000],
           ['MS12', 'Maaz',    25, 'Karachi',   'AFTERNOON', 'group C', 'Male',   90.5, 81.3, np.nan],
           ['MS13', 'Mujahid', 18, 'Lahore',    'MORNING',   'group D', 'Male',   np.nan, 76.5, 7000],
           ['MS14', 'Sara',  28, 'Multan',    'AFTERNOON',   'group A', 'Female',   84.1, 76.0, 8000],
           ['MS15', 'Fatima',   33, 'Sialkot',   'AFT',       'group C', 'Female',   90.5, 81.3, 3500],
           ['MS16', 'Kakamanna',  42, 'Multan',   'AFTERNOON', 'group A', 'Male',   90.5, 81.3, 3800],

      ]

list1 = ['rollno', 'name', 'age', 'address', 'session', 'group', 'gender', 'subj1', 'subj2', 'scholarship']
df = pd.DataFrame(data=a2DNumPyArray, columns=list1)
df

In [ ]:
# If there is a missing value NaN, by default it is listed at the end when using sort_values function
# Regardless of the sorting order (Ascending or Descending)
d1 = df.sort_values(by=['scholarship'])
d1.tail()

In [ ]:
# If the argument na_position='first', it will be listed at the top.
d2 = df.sort_values(by=['scholarship'], na_position='first')
d2.head()

## 2. Sorting dataframes using `df.sort_index()`
> We have observed while using `df.sort_values()`, by default the sorting is performed in the vertical direction. If you want to sort in the row direction, we can set the`axis` argument of  `df.sort_values()` method to 1, which is by default set to zero. However, it may cause problems when a number and a string are mixed

- So to sort a dataframe in the horizontal direction, we normally use **`df.sort_index()`** method.
```
df.sort_index(axis=0,ascending=True,inplace=False,kind='quicksort',na_position='last',ignore_index=False)
```
Where,
-  `axis`: The axis along which to sort. The value 0 identifies the rows, and 1 identifies the columns. (default is 0)
- `ascending`: If True then ascending and If False then descending
- `inplace`:  If True, perform operation in-place.
- `kind`: {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'. This option is only applied when sorting on a single column or label.
- `na_position`: If first then puts NaNs at the beginning. Default is last
- `ignore_index`: If True, the resulting axis will be labeled 0, 1, , n - 1. Default False

In [ ]:
# Let us create a simple data frame
import pandas as pd
df = pd.DataFrame({
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Kamal', 'Saima', 'Jamal', 'Shaikh', 'Farzana'],
    'gender' : ['M', 'F', 'M', 'M', 'F'],
    'grade'  : ['A', 'A', 'B', 'B', 'A'],
    'marks'  : [ 21,  23,  12,  14,  20],
    'city' : ['Lahore', 'Peshawer', 'Lahore', 'Karachi', 'Peshawer']
})
df

### a. Sort by Column Labels
- By passing the axis argument with a value 0 or 1, the sorting can be done on the column labels. By default, axis=0

In [ ]:
df1 = df.sort_index(axis=1)
df1

In [ ]:
# Let us do an in-place sort and in descending order
df1 = df.sort_index(axis=1, ascending=False)
df1

### b. Sort by Index
- This will be a three step process
    - Make the specific column as index
    - Call sort_index() with axis=0
    - Reset Index

**Let us sort by grades**

In [ ]:
# Lets us set the roll_no column as index
df1 = df.set_index(["grade"])
df1

In [ ]:
# sort the datframe by index 
df2 = df1.sort_index(axis=0)
df2

In [ ]:
# After sort you can reset the index if you want
df2.reset_index(inplace=True, drop=False)
df2